---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesCannotFormClosedLoop
source: html/54c3b6bc-173f-48be-a985-8695c90290b1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SculptingCurvesCannotFormClosedLoop Property

Curves cannot form a closed loop.

## Syntax (C#)
```csharp
public static FailureDefinitionId SculptingCurvesCannotFormClosedLoop { get; }
```